[{"ID":"1471","title":"POO y MVC en PHP","author":"Eugenia Bahit","content":"<strong>El paradigma de la Programación Orientada a Objetos en PHP con el patrón arquitectónico MVC.<\/strong>\r\n\r\n"Me propuse escribir este libro, fundamentalmente porque me apasionan de igual forma, tanto la programación orientada a objetos como el patrón MVC y el lenguaje PHP. Pero éste, seguramente, no fue el único agente motivador. Hacía tiempo que tenía ganas de sentarme tranquila y escribir algo que pudiese ser de gran utilidad para otros programadores.\r\n\r\nA lo largo del libro, aprenderás a construir una aplicación orientada a objetos en PHP, utilizando el patrón arquitectónico MVC, desde cero, sin necesidad de utilizar ningún framework, incluso aunque tus conocimientos de programación sean básicos. Aprenderás a hacerlo tú mismo, logrando una abstracción completa y absoluta, tanto del modelo, la vista y el controlador, como de la independencia de lenguajes de programación y diseño."\r\n\r\n(<a href="http:\/\/eugeniabahit.blogspot.com\/p\/poo-y-mvc-en-php.html">Eugenia Bahit<\/a>)","content_short":"<strong>El paradigma de la Programación Orientada a Objetos en PHP con el patrón arquitectónico MVC.<\/strong>\r\n\r\n"Me propuse escribir este libro, fundamentalmente porque me apasionan de igual forma, tanto la programación orientada ...","publisher":"Autoedición","publisher_date":"2011","pages":"66","language":"spanish","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/poo-y-mvc-en-php\/","url_download":"https:\/\/openlibra.com\/book\/poo-y-mvc-en-php","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/08\/POO_MVC_PHP_OpenLibra-350x459.gif","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/08\/POO_MVC_PHP_OpenLibra-110x153.gif","num_comments":"0","categories":[{"category_id":226,"name":"PHP","nicename":"programacion_php"},{"category_id":90,"name":"POO","nicename":"poo"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":411,"name":"MVC","nicename":"mvc"},{"tag_id":45,"name":"php","nicename":"php-2"},{"tag_id":2990,"name":"POO","nicename":"poo"}]},{"ID":"595","title":"Desarrollo de aplicaciones iPhone e iPad para principiantes","author":"Varios","content":"Quieres aprender cómo programar para el iPad o iPhone, y seguro que te consideras una persona inteligente -pero cuando te has encontrado con líneas de código o instrucciones demasiado técnicas, has sentido que tu cabeza estaba a punto de estallar. ¿Se te ponen los ojos vidriosos cuando sigues instrucciones complicadas? Oyes una vocecita en tu cabeza que te susurra, “Pero a dónde vas! el cerebro se quedó seis líneas atrás, pero incomprensiblemente sigues escaneando la página—creyendo que no eres tan lento cómo piensas. Genial!”\r\n\r\nA ver si esto te suena familiar... tienes una duda con algo bastante técnico y decides recurrir a Google para buscar la solución del problema. Pinchas sobre un enlace y alguien ha hecho exactamente la misma pregunta! Te emocionas mientras que la página carga, pero, por desgracia se trata de un foro, un chat donde geeks, gente con experiencia, habla con cierta base y postean inteligibles códigos). Localizas la pregunta que buscabas, que no es más que la duda que tienes, y esa pregunta va seguida de… demasiado tarde! Tu cerebro ha echado el cierre y te sientes frustrado y en tensión, como si tuvieras nudos en el estómago.\r\n\r\nTe suena familiar?\r\n\r\n¿Sí? Entonces este libro va dirigido a tí! Te imagino en una tienda de libros o en el aeropuerto, echando un vistazo a una revista, buscando algo de interés. Debido a lo acotado de este tema, imagino que podrás permitirte un iPhone, un Mac un coche y billetes de avión. Probablemente estés interesado en la floreciente industria de los dispositivos handhelds y en el tremendo ritmo de evolución de las memorias y microprocesadores… en cómo ideas fugaces pueden convertirse en plataformas de computación totalmente nuevas , en aplicaciones de software potentes, en herramientas útiles y juegos de inteligencia… quizá incluso hasta en la pasta! Te estarás preguntando si puedes entrar en acción haciendo uso de tu intelecto y experiencia técnica para servir a las masas.\r\n","content_short":"Quieres aprender cómo programar para el iPad o iPhone, y seguro que te consideras una persona inteligente -pero cuando te has encontrado con líneas de código o instrucciones demasiado técnicas, ...","publisher":"Apress","publisher_date":"2011","pages":"297","language":"spanish","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/desarrollo-de-aplicaciones-iphone-e-ipad-para-principiantes\/","url_download":"https:\/\/openlibra.com\/book\/desarrollo-de-aplicaciones-iphone-e-ipad-para-principiantes","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/04\/aplicaciones_iphone_e_ipad_principiantes.jpg","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/04\/aplicaciones_iphone_e_ipad_principiantes-110x153.jpg","num_comments":"0","categories":[{"category_id":221,"name":"Dispositivos Móviles","nicename":"dispositivos_moviles"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":284,"name":"app","nicename":"app"},{"tag_id":133,"name":"iPad","nicename":"ipad"},{"tag_id":134,"name":"iPhone","nicename":"iphone"},{"tag_id":247,"name":"mobile","nicename":"mobile"},{"tag_id":248,"name":"phone","nicename":"phone"}]},{"ID":"853","title":"jQuery Fundamentals","author":"Rebecca Murphey","content":"jQuery es una biblioteca o framework de JavaScript, creada inicialmente por John Resig, que permite simplificar la manera de interactuar con los documentos HTML, manipular el árbol DOM, manejar eventos, desarrollar animaciones y agregar interacción con la técnica AJAX a páginas web. Fue presentada el 14 de enero de 2006 en el BarCamp NYC.\r\n\r\njQuery es software libre y de código abierto, posee un doble licenciamiento bajo la Licencia MIT y la Licencia Pública General de GNU v2, permitiendo su uso en proyectos libres y privativos. jQuery, al igual que otras bibliotecas, ofrece una serie de funcionalidades basadas en JavaScript que de otra manera requerirían de mucho más código, es decir, con las funciones propias de esta biblioteca se logran grandes resultados en menos tiempo y espacio.\r\n\r\nEste libro, creado en primer término por Rebecca Murphey y enriquecido por las aportaciones de algunos diseñadores y desarrolladores web como James Padolsey o Paul Irish, es un excelente recurso para aprender los fundamentos de jQuery. El material está en constante evolución y además del texto podemos encontrar ejemplos y ejercicios.\r\n","content_short":"jQuery es una biblioteca o framework de JavaScript, creada inicialmente por John Resig, que permite simplificar la manera de interactuar con los documentos HTML, manipular el árbol DOM, manejar eventos, ...","publisher":"Autoedición","publisher_date":"2010","pages":"72","language":"english","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/jquery-fundamentals\/","url_download":"https:\/\/openlibra.com\/book\/jquery-fundamentals","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/05\/jquery_fundamentals-325x461.gif","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/05\/jquery_fundamentals-110x153.gif","num_comments":"0","categories":[{"category_id":223,"name":"Javascript \/ AJAX","nicename":"programacion_javascript_ajax"},{"category_id":329,"name":"jQuery","nicename":"jquery_libros_programacion"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":2991,"name":"AJAX","nicename":"ajax"},{"tag_id":2986,"name":"Javascript","nicename":"javascript"},{"tag_id":2987,"name":"jQuery","nicename":"jquery"}]},{"ID":"3752","title":"Introducción a .NET","author":"Jordi Ceballos Villach","content":".NET es el entorno de ejecución en el que se cargan las aplicaciones desarrolladas en los distintos lenguajes, ampliando el conjunto de servicios del sistema operativo (W2k y W2003). Permite integrar proyectos en distintos lenguajes soportados por la plataforma .Net, como C++, Visual Basic, C#, entre otros.\r\n\r\nLa herramienta de desarrollo compila el código fuente de cualquiera de los lenguajes soportados por .NET en un código intermedio, el CIL (Common Intermediate Language) antes conocido como MSIL (Microsoft Intermediate Language), similar al BYTECODE de Java. Para generarlo, el compilador se basa en la especificación CLS (Common Language Specification) que determina las reglas necesarias para crear el código MSIL compatible con el CLR.\r\n\r\nEl siguiente presenta una división en módulos que tratan los siguientes aspectos:\r\n<ul>\r\n<li>La plataforma .NET<\/li>\r\n<li>El lenguaje C#<\/li>\r\n<li>.NET Framework<\/li>\r\n<li>ADO.NET<\/li>\r\n<li>Windows Forms<\/li>\r\n<li>ASP.NET<\/li>\r\n<li>WPF<\/li>\r\n<li>Windows Mobile<\/li>\r\n<\/ul>","content_short":".NET es el entorno de ejecución en el que se cargan las aplicaciones desarrolladas en los distintos lenguajes, ampliando el conjunto de servicios del sistema operativo (W2k y W2003). Permite ...","publisher":"UOC","publisher_date":"2009","pages":"102","language":"spanish","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/introduccion-a-net\/","url_download":"https:\/\/openlibra.com\/book\/introduccion-a-net","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2012\/07\/uoc-introduccion-net-325x461.jpg","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2012\/07\/uoc-introduccion-net-110x153.jpg","num_comments":"0","categories":[{"category_id":305,"name":".NET","nicename":"net"},{"category_id":224,"name":"Otros Lenguajes","nicename":"programacion_otros_lenguajes"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":3000,"name":".NET","nicename":"net"},{"tag_id":1413,"name":"ADO","nicename":"ado"},{"tag_id":638,"name":"ASP","nicename":"asp"},{"tag_id":2999,"name":"C","nicename":"c"},{"tag_id":262,"name":"Microsoft","nicename":"microsoft"},{"tag_id":32,"name":"programación","nicename":"programacion"},{"tag_id":239,"name":"UOC","nicename":"uoc"},{"tag_id":289,"name":"Windows Mobile","nicename":"windows_mobile"},{"tag_id":1414,"name":"WPF","nicename":"wpf"}]},{"ID":"1600","title":"Practical Artifical Intelligence Programming with Java","author":"Mark Watson","content":"Este libro ha sido escrito para aquellos desarrolladores que ya conocen los fundamentos del lenguaje Java y que desean adentranrse en el aprendizaje práctico de la programación sobre Inteligencia Artificial (IA) y sus técnicas de procesado. \r\n\r\nLa propuesta de este libro ha sido revisada para resultar amena y divertida: redactado a modo de recetario de cocina, los capítulos pueden ser estudiados en cualquier orden y simepre presentan la misma estructura: la motivación para aprender una determinada técnica, la teoría y un ejemplo en Java con el que podemos experimentar lo estudiado. ","content_short":"Este libro ha sido escrito para aquellos desarrolladores que ya conocen los fundamentos del lenguaje Java y que desean adentranrse en el aprendizaje práctico de la programación sobre Inteligencia Artificial ...","publisher":"Autoedición","publisher_date":"2008","pages":"222","language":"english","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/practical-artifical-intelligence-programming-with-java\/","url_download":"https:\/\/openlibra.com\/book\/practical-artifical-intelligence-programming-with-java","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/08\/Practical_AI_Programming_with_Java_OpenLibra-350x459.gif","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/08\/Practical_AI_Programming_with_Java_OpenLibra-110x153.gif","num_comments":"0","categories":[{"category_id":222,"name":"Java","nicename":"programacion_java"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":692,"name":"AI","nicename":"ai"},{"tag_id":267,"name":"IA","nicename":"ia"},{"tag_id":97,"name":"java","nicename":"java"},{"tag_id":693,"name":"JVM","nicename":"jvm"},{"tag_id":694,"name":"RDF","nicename":"rdf"}]},{"ID":"9505","title":"Desarrollo fácil y paso a paso de aplicaciones para Android usando MIT App Inventor","author":"Rafael Alberto Moreno Parra","content":"Android es actualmente (Mayo de 2013) el sistema operativo para smartphones y tablets más famoso, con una enorme cuota de mercado. \r\n\r\nDesarrollar software para esta plataforma permite llegar a una gran cantidad de público. Sin embargo, abordar un desarrollo directo con el lenguaje de programación Java, XML, emulación virtual y ambiente de dispositivo móvil puede ser intimidante. Esa es la razón por la que Google ideó una forma sencilla de desarrollar aplicaciones para Android: haciendo uso de programación gráfica y atraer así a los desarrolladores. Google, sin embargo, dejó de lado este proyecto el cual fue retomado por el MIT y se ha mantenido así.\r\n\r\nEl libro sigue el formato de llevar paso a paso al lector desde preparar el ambiente de desarrollo, pasando por el diseño de la pantalla en un Smartphone Android, los diferentes componentes visuales y no visuales, programación usando bloques como si fuese un rompecabezas, variables, uso del sí condicional, ciclos o bucles, hasta el uso de las capacidades propias de un Smartphone como la cámara, video o el acelerómetro.\r\n\r\nMIT App Inventor oficialmente es una herramienta para desarrollo en línea por lo que requiere conexión permanente a Internet. Sin embargo, en el Anexo 1 se muestra como trabajar fuera de línea o sin conexión a Internet.","content_short":"Android es actualmente (Mayo de 2013) el sistema operativo para smartphones y tablets más famoso, con una enorme cuota de mercado. \r\n\r\nDesarrollar software para esta plataforma permite llegar a una ...","publisher":"Autoedición","publisher_date":"2013","pages":"104","language":"spanish","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/desarrollo-android-usando-mit-app-inventor\/","url_download":"https:\/\/openlibra.com\/book\/desarrollo-android-usando-mit-app-inventor","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2013\/05\/Desarrollo-para-Android-usando-MIT-AppInventor-OpenLibra-325x461.gif","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2013\/05\/Desarrollo-para-Android-usando-MIT-AppInventor-OpenLibra-110x153.gif","num_comments":"0","categories":[{"category_id":221,"name":"Dispositivos Móviles","nicename":"dispositivos_moviles"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":132,"name":"android","nicename":"android"},{"tag_id":1585,"name":"apps","nicename":"apps"},{"tag_id":421,"name":"Inventor","nicename":"inventor"},{"tag_id":32,"name":"programación","nicename":"programacion"}]},{"ID":"897","title":"A byte of VIM (for VIM v.7)","author":"Swaroop Chitlur","content":"Vim (del inglés Vi IMproved) es una versión mejorada del editor de texto vi, presente en todos los sistemas UNIX.\r\n\r\nSu autor, Bram Moolenaar, presentó la primera versión en 1991, fecha desde la que ha experimentado muchas mejoras. La principal característica tanto de Vim como de Vi consiste en que disponen de diferentes modos entre los que se alterna para realizar ciertas operaciones, lo que los diferencia de la mayoría de editores comunes, que tienen un sólo modo en el que se introducen los órdenes mediante combinaciones de teclas o interfaces gráficas.\r\n\r\n"A Byte of Vim" es un libro cuyo objetivo es ayudarle a sacar el máximo partido de este fantástico editor. Está especialmente planteado para usuarios que nunca han tenido contacto ni con este software, ni su antecesor vi.\r\n\r\nEl documento se divide en dos partes. La primera de ella se centra en explicar qué es Vim y cómo se usa en su nivel elemental.\r\n\r\nLa segunad parte del libro es para aquellos usuarios que ya tienen un conocimiento del programa y desean aprender todas las características que convierten a este editor en un poderoso aliado del programador. En este apartado se recoge también cómo extender Vim y cómo crear nuestros propios plugins.\r\n","content_short":"Vim (del inglés Vi IMproved) es una versión mejorada del editor de texto vi, presente en todos los sistemas UNIX.\r\n\r\nSu autor, Bram Moolenaar, presentó la primera versión en 1991, fecha ...","publisher":"Autoedición","publisher_date":"2010","pages":"89","language":"english","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/a-byte-of-vim\/","url_download":"https:\/\/openlibra.com\/book\/a-byte-of-vim","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/06\/A_Byte_of_VIM.png","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/06\/A_Byte_of_VIM.png","num_comments":"0","categories":[{"category_id":241,"name":"Herramientas","nicename":"herramientas"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":242,"name":"editor","nicename":"editor"},{"tag_id":243,"name":"IDE","nicename":"ide"},{"tag_id":244,"name":"VIM","nicename":"vim"}]},{"ID":"772","title":"Silverlight for Windows Phone","author":"Puja Pramudya","content":"Microsoft Silverlight es una estructura para aplicaciones web que agrega nuevas funciones multimedia como la reproducción de vídeos, gráficos vectoriales, animaciones e interactividad, en forma similar a lo que hace Adobe Flash.\r\n\r\nSilverlight compite con Adobe Flex, Nexaweb, OpenLaszlo y algunas presentaciones de componentes AJAX. La primera versión de Silverlight fue lanzada en septiembre de 2007 y actualmente su versión 4.0 se distribuye de forma gratuita.\r\n\r\nEn este nuevo libro, se ponen las bases para el desarrollo de aplicaciones complejas a través del uso de Silverlight como estándar. Como tónica general en la publicación de manuales Microsoft, los códigos resultan muy sencillos de seguir gracias a la gran cantidad de ilustraciones y comentarios.\r\n","content_short":"Microsoft Silverlight es una estructura para aplicaciones web que agrega nuevas funciones multimedia como la reproducción de vídeos, gráficos vectoriales, animaciones e interactividad, en forma similar a lo que hace ...","publisher":"Microsoft","publisher_date":"2011","pages":"157","language":"english","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/silverlight-for-windows-phone\/","url_download":"https:\/\/openlibra.com\/book\/silverlight-for-windows-phone","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/05\/Silverlight-for-Windows-Phone-326x461.jpg","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/05\/Silverlight-for-Windows-Phone-110x153.jpg","num_comments":"0","categories":[{"category_id":221,"name":"Dispositivos Móviles","nicename":"dispositivos_moviles"},{"category_id":224,"name":"Otros Lenguajes","nicename":"programacion_otros_lenguajes"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":2991,"name":"AJAX","nicename":"ajax"},{"tag_id":2986,"name":"Javascript","nicename":"javascript"},{"tag_id":262,"name":"Microsoft","nicename":"microsoft"},{"tag_id":247,"name":"mobile","nicename":"mobile"},{"tag_id":248,"name":"phone","nicename":"phone"},{"tag_id":360,"name":"SilverLight","nicename":"silverlight"},{"tag_id":263,"name":"Windows","nicename":"windows"}]},{"ID":"1870","title":"Fundamentos de jQuery","author":"Rebecca Murphey","content":"jQuery se está convirtiendo rápidamente en una herramienta que todo desarrollador de interfaces web debería de conocer. El propósito de este libro es proveer un resumen de la biblioteca, de tal forma que para cuando lo haya terminado de leer, será capaz de realizar tareas básicas utilizando jQuery y tendrá una sólida base para continuar el aprendizaje. El libro fue diseñado para ser utilizado como material en un salón de clases, pero también puede ser útil para estudiarlo de forma individual.\r\n\r\nLa modalidad de trabajo es la siguiente: En primer lugar se dedicará tiempo a comprender un concepto para luego realizar un ejercicio relacionado. Algunos de los ejercicios pueden llegar a ser triviales, mientras que otros no tanto. El objetivo es aprender a resolver de manera fácil lo que normalmente se resolvería con jQuery.","content_short":"jQuery se está convirtiendo rápidamente en una herramienta que todo desarrollador de interfaces web debería de conocer. El propósito de este libro es proveer un resumen de la biblioteca, de ...","publisher":"Autoedición","publisher_date":"2011","pages":"112","language":"spanish","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/fundamentos-de-jquery\/","url_download":"https:\/\/openlibra.com\/book\/fundamentos-de-jquery","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/10\/Fundamentos-de-jQuery-OpenLibra-350x459.gif","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2011\/10\/Fundamentos-de-jQuery-OpenLibra-110x153.gif","num_comments":"0","categories":[{"category_id":223,"name":"Javascript \/ AJAX","nicename":"programacion_javascript_ajax"},{"category_id":329,"name":"jQuery","nicename":"jquery_libros_programacion"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":2986,"name":"Javascript","nicename":"javascript"},{"tag_id":2987,"name":"jQuery","nicename":"jquery"}]},{"ID":"2295","title":"Diseño de una Metodología Ágil de Desarrollo de Software","author":"Schenone Marcelo Hernán","content":"Esta tésis tiene como propósito la construcción de una Metodología Ágil de Desarrollo de Software la cual utiliza UML como notación. Si bien podrá ser empleada en proyectos de distinto tamaño y complejidad, su aplicación tendrá como objetivo proyectos de pequeña escala y riesgo limitado. También será independiente del lenguaje o la arquitectura utilizada, así como del tipo de software que se está construyendo. \r\n \r\nPara desarrollar esta metodología se comenzará por un relevamiento de las metodologías y notaciones actualmente empleadas (Rational Unified Process, UML, SCRUM, OPEN, Extreme Programming, etc), un posterior refinamiento de las mismas y el desarrollo paulatino de un proceso que incorpore las mejores y más avanzadas prácticas existentes en cada etapa del desarrollo. \r\n \r\nFinalmente, se describe la realización de dos casos prácticos resueltos con la metodología propuesta. El primer caso práctico estará basado en un sistema de integración de servicios para ONGs, y el segundo en un sistema de administración de recursos de hardware y software. ","content_short":"Esta tésis tiene como propósito la construcción de una Metodología Ágil de Desarrollo de Software la cual utiliza UML como notación. Si bien podrá ser empleada en proyectos de distinto ...","publisher":"Fiuba","publisher_date":"2004","pages":"199","language":"spanish","url_details":"http:\/\/www.etnassoft.com\/biblioteca\/diseno-de-una-metodologia-agil-de-desarrollo-de-software\/","url_download":"https:\/\/openlibra.com\/book\/diseno-de-una-metodologia-agil-de-desarrollo-de-software","cover":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2012\/01\/diseno-metodologia-agil-de-desarrollo-software-OpenLibra-350x459.gif","thumbnail":"http:\/\/collection.openlibra.com.s3.amazonaws.com\/covers\/2012\/01\/diseno-metodologia-agil-de-desarrollo-software-OpenLibra-110x153.gif","num_comments":"0","categories":[{"category_id":218,"name":"Metodologías Ágiles","nicename":"metodologias_agiles"},{"category_id":220,"name":"Programación","nicename":"libros_programacion"}],"tags":[{"tag_id":495,"name":"agilismo","nicename":"agilismo"},{"tag_id":1074,"name":"metodologías","nicename":"metodologias"},{"tag_id":384,"name":"scrum","nicename":"scrum"},{"tag_id":312,"name":"UML","nicename":"uml"},{"tag_id":105,"name":"XP","nicename":"xp"}]}];